tap "aws/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "localstack/tap"
brew "abseil"
brew "brotli"
brew "highway"
brew "jpeg-turbo"
brew "xz"
brew "libtiff"
brew "little-cms2"
brew "openexr"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "apr"
brew "ca-certificates"
brew "openssl@3"
brew "apr-util"
brew "assimp"
brew "autoconf"
brew "automake"
brew "c-ares"
brew "libnghttp2"
brew "libuv"
brew "node"
brew "aws-amplify"
brew "libyaml"
brew "readline"
brew "sqlite"
brew "aws-elasticbeanstalk"
brew "pycparser"
brew "cffi"
brew "cryptography"
brew "aws-sam-cli"
brew "awscli"
brew "bdw-gc"
brew "bison"
brew "boost"
brew "brew-cask-completion"
brew "freetype"
brew "gettext"
brew "glib"
brew "xorgproto"
brew "libxcb"
brew "libx11"
brew "cairo"
brew "cfn-lint"
brew "chruby"
brew "cjson"
brew "cmake"
brew "cmocka"
brew "libssh2"
brew "rtmpdump"
brew "curl"
brew "unixodbc"
brew "freetds"
brew "libavif"
brew "gd"
brew "gmp"
brew "krb5"
brew "libzip"
brew "oniguruma"
brew "openldap"
brew "php"
brew "composer"
brew "coreutils"
brew "dav1d"
brew "dbus"
brew "docker-completion"
brew "docker", link: false
brew "docutils"
brew "double-conversion"
brew "frei0r"
brew "libevent"
brew "nettle"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "harfbuzz"
brew "openjpeg"
brew "leptonica"
brew "libarchive"
brew "libass"
brew "mbedtls"
brew "librist"
brew "mpg123"
brew "opus"
brew "libsndfile"
brew "libvpx"
brew "pango"
brew "rav1e"
brew "rubberband"
brew "sdl2"
brew "speex"
brew "srt"
brew "svt-av1"
brew "tesseract"
brew "x264"
brew "zeromq"
brew "zimg"
brew "ffmpeg"
brew "ffmpeg@4"
brew "fmt"
brew "gdbm"
brew "jbig2dec"
brew "libidn"
brew "ghostscript"
brew "git"
brew "git-lfs"
brew "gnu-getopt"
brew "libgpg-error"
brew "libgcrypt"
brew "libksba"
brew "gnupg"
brew "go"
brew "gobject-introspection"
brew "handbrake"
brew "httpd"
brew "httpie"
brew "jasper"
brew "libde265"
brew "shared-mime-info"
brew "libheif"
brew "libomp", link: true
brew "libraw"
brew "imagemagick"
brew "jpeg"
brew "jq"
brew "kubernetes-cli"
brew "libffi"
brew "libmng"
brew "shaderc"
brew "vulkan-headers"
brew "vulkan-loader"
brew "libpthread-stubs"
brew "z3"
brew "luajit"
brew "luajit-openresty"
brew "mas"
brew "md4c"
brew "minikube"
brew "nlohmann-json"
brew "pugixml"
brew "qt"
brew "utf8cpp"
brew "mkvtoolnix"
brew "mp4v2"
brew "mujs"
brew "vapoursynth"
brew "yt-dlp"
brew "mpv"
brew "nvm"
brew "openssl@1.1"
brew "pkcs11-helper"
brew "openvpn"
brew "pipx"
brew "protobuf"
brew "pyenv"
brew "python-distlib"
brew "python-jinja", link: false
brew "python-mutagen"
brew "python-packaging", link: false
brew "python@3.10"
brew "tcl-tk"
brew "python-tk@3.10"
brew "python-typing-extensions"
brew "python@3.11"
brew "python@3.9"
brew "pyyaml", link: false
brew "rclone"
brew "ruby-install"
brew "rust"
brew "serverless"
brew "six"
brew "sqsmover"
brew "swift-protobuf"
brew "swiftlint"
brew "transmission-cli"
brew "virtualenv"
brew "wget"
brew "youtube-dl"
brew "z"
brew "zlib"
brew "zsh"
brew "hashicorp/tap/terraform"
brew "localstack/tap/localstack-cli"
cask "1password"
cask "1password-cli"
cask "android-studio"
cask "atom"
cask "audacity"
cask "audio-hijack"
cask "authy"
cask "blender"
cask "brave-browser"
cask "calibre"
cask "carbon-copy-cloner"
cask "cleanshot"
cask "clipgrab"
cask "codekit"
cask "discord"
cask "docker"
cask "dropbox"
cask "dropshare"
cask "figma"
cask "firefox"
cask "gas-mask"
cask "gitkraken"
cask "google-drive"
cask "google-earth-pro"
cask "graphql-playground"
cask "izip"
cask "kitematic"
cask "loom"
cask "loopback"
cask "macfuse"
cask "mamp"
cask "microsoft-edge"
cask "notion"
cask "pixelsnap"
cask "pocket-casts"
cask "postman"
cask "raycast"
cask "rsyncosx"
cask "runjs"
cask "signal"
cask "sketch"
cask "skyfonts"
cask "slack"
cask "soundsource"
cask "spotify"
cask "superduper"
cask "tableplus"
cask "the-unarchiver"
cask "thinkorswim"
cask "tor-browser"
cask "tower"
cask "transmit"
cask "tunnelblick"
cask "utm"
cask "veracrypt"
cask "visual-studio-code"
cask "vlc"
cask "vmware-fusion"
cask "warp"
cask "webpquicklook"
cask "whatsapp"
cask "zoom"
mas "1Password for Safari", id: 1569813296
mas "Bear", id: 1091189122
mas "Better Rename 9", id: 414209656
mas "Compressor", id: 424390742
mas "Dark Noise", id: 1465439395
mas "Deliveries", id: 290986013
mas "Final Cut Pro", id: 424389933
mas "Forecast Bar", id: 982710545
mas "GarageBand", id: 682658836
mas "Goodnotes", id: 1444383602
mas "Harvest", id: 506189836
mas "Hidden Bar", id: 1452453066
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Kindle", id: 302584613
mas "Logic Pro", id: 634148309
mas "Microsoft Remote Desktop", id: 1295203466
mas "Motion", id: 434290957
mas "Notability", id: 360593530
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pine Player", id: 1112075769
mas "Pixelmator Pro", id: 1289583905
mas "Playgrounds", id: 1496833156
mas "Portal", id: 1436994560
mas "Prime Video", id: 545519333
mas "RadarScope", id: 288419283
mas "Remote Desktop", id: 409907375
mas "TeraCopy", id: 1378806557
mas "Todoist", id: 585829637
mas "Windows App", id: 1295203466
mas "Xcode", id: 497799835
mas "YubiKey Personalization Tool", id: 638161122
vscode "aaron-bond.better-comments"
vscode "akamud.vscode-theme-onedark"
vscode "alefragnani.project-manager"
vscode "andischerer.theme-atom-one-dark"
vscode "anseki.vscode-color"
vscode "aswinkumar863.smarty-template-support"
vscode "atlassian.atlascode"
vscode "atomiks.moonlight"
vscode "bigous.vscode-multi-line-tricks"
vscode "bradlc.vscode-tailwindcss"
vscode "bubersson.theme-hop-light"
vscode "burkeholland.simple-react-snippets"
vscode "capaj.vscode-exports-autocomplete"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "chrmarti.regex"
vscode "codeium.codeium"
vscode "codezombiech.gitignore"
vscode "codium.codium"
vscode "craigmaslowski.erb"
vscode "cssho.vscode-svgviewer"
vscode "cyriacduchatenet.monterey-dark-theme"
vscode "danielthielking.aws-cloudformation-yaml"
vscode "dbaeumer.jshint"
vscode "dbaeumer.vscode-eslint"
vscode "deinsoftware.vitest-snippets"
vscode "docsmsft.docs-visual-areas"
vscode "dotjoshjohnson.xml"
vscode "drcika.apc-extension"
vscode "dsznajder.es7-react-js-snippets"
vscode "dunstontc.dark-plus-syntax"
vscode "eamodio.gitlens"
vscode "earshinov.permute-lines"
vscode "editorconfig.editorconfig"
vscode "eg2.vscode-npm-script"
vscode "eliverlara.andromeda"
vscode "emmanuelbeziat.vscode-great-icons"
vscode "equinusocio.vsc-community-material-theme"
vscode "equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "eserozvataf.one-dark-pro-monokai-darker"
vscode "figma.figma-vscode-extension"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "framer.framer-syntax"
vscode "gerane.theme-monokai-best"
vscode "ghgofort.neon-vommit"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "glenn2223.live-sass"
vscode "gokulkrishh.night-mode"
vscode "golang.go"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-execution"
vscode "graphql.vscode-graphql-syntax"
vscode "hashicorp.terraform"
vscode "hkh12.pitch-black"
vscode "htmlhint.vscode-htmlhint"
vscode "humao.rest-client"
vscode "jaimeolivares.yuml"
vscode "jakewilson.vscode-cdnjs"
vscode "jkjustjoshing.vscode-text-pastry"
vscode "jock.svg"
vscode "joelday.docthis"
vscode "johnlindquist.kit-extension"
vscode "jolaleye.horizon-theme-vscode"
vscode "jpoissonnier.vscode-styled-components"
vscode "kaleidoscope-app.vscode-ksdiff"
vscode "kevinrose.vsc-python-indent"
vscode "mgmcdermott.vscode-language-babel"
vscode "mightbesimon.emoji-icons"
vscode "mkaufman.htmlhint"
vscode "mrmlnc.vscode-apache"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "oderwat.indent-rainbow"
vscode "ohansemmanuel.css-grid-snippets"
vscode "orta.vscode-jest"
vscode "pkief.material-icon-theme"
vscode "pnp.polacode"
vscode "postman.postman-for-vscode"
vscode "prisma.prisma"
vscode "qub.qub-xml-vscode"
vscode "quicktype.quicktype"
vscode "qwtel.sqlite-viewer"
vscode "ravasthi.rpa-eslint-snippets"
vscode "redhat.vscode-yaml"
vscode "rendinjast.amoled-black"
vscode "richie5um2.vscode-sort-json"
vscode "rifi2k.format-html-in-php"
vscode "ritwickdey.liveserver"
vscode "rvest.vs-code-prettier-eslint"
vscode "shopify.ruby-lsp"
vscode "silvenon.mdx"
vscode "sirtori.indenticator"
vscode "sleistner.vscode-fileutils"
vscode "spoonscen.es6-mocha-snippets"
vscode "streetsidesoftware.code-spell-checker"
vscode "supermaven.supermaven"
vscode "syntaxfm.syntaxfm"
vscode "sysoev.vscode-open-in-github"
vscode "techer.open-in-browser"
vscode "tonka3000.raycast"
vscode "tyriar.sort-lines"
vscode "uber.baseweb"
vscode "unifiedjs.vscode-mdx"
vscode "viktorqvarfordt.vscode-pitch-black-theme"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vittorioromeo.expand-selection-to-scope"
vscode "vscode-icons-team.vscode-icons"
vscode "wallabyjs.quokka-vscode"
vscode "wayou.vscode-todo-highlight"
vscode "wix.vscode-import-cost"
vscode "wmaurer.change-case"
vscode "yzane.markdown-pdf"
vscode "zhuangtongfa.material-theme"
vscode "zignd.html-css-class-completion"
