#Brewfile

# Taps
tap "buo/cask-upgrade"
tap "caskroom/cask"
tap "caskroom/versions"
tap "ethereum/ethereum"
tap "homebrew/bundle"
tap "homebrew/php"
tap "homebrew/services"

# Unix
brew "ctags"
brew "git"
brew "openssl"
brew "vim"
brew "zsh"

# Heroku
brew "heroku-toolbelt"

# Quicklook Plugins
brew "qlcolorcode"
brew "qlstephen"
brew "qlmarkdown"
brew "quicklook-json"
brew "qlprettypatch"
brew "quicklook-csv"
brew "betterzipql"
brew "webpquicklook"
brew "suspicious-package"

# Image/Video manipulation
brew "imagemagick"
brew "handbrake"
brew "ffmpeg"
brew "mkvtoolnix"
brew "mp4v2"
brew "mpv"
brew "blender"
brew "fspy"

# Languages and package managers
brew "node"
brew "nvm"
brew "yarn"

# Databases
brew "postgres", restart_service: true
brew "redis", restart_service: true


# Homebrew Cask Installs
# Browsers
cask "google-chrome"
cask "blisk"
cask "firefox"
cask "caskroom/versions/firefox-developer-edition"
cask "brave-browser"
cask "opera"
cask "torbrowser"

# Productivity
cask "alfred"
cask "notion"

# Storage/Documents
cask "dropbox"
cask "google-backup-and-sync"
cask "arq"
cask "code42-crashplan"

# Design
cask "balsamiq-mockups"
cask "skyfonts"
cask "colorsnapper"
cask "sketch"
cask "iconjar"

# Development
cask "hyper"
cask "iterm2"
cask "macvim"
cask "codekit"
cask "visual-studio-code"
cask "postman"
cask "paw"
cask "docker"
cask "github"
cask "mamp"
cask "docker"
cask "kitematic"
cask "transmit"
cask "vmware-fusion"
cask "virtualbox"
cask "sourcetree"
cask "dash"
cask "java"
cask "mou"
cask "graphql-playground"

# Database
cask "postgres"
cask "postico"
cask "navicat-for-sqlite"
cask "navicat-for-postgresql"
cask "tableplus"
cask "dbkoda"

# Communication
cask "slack"
cask "rocket-chat"
cask "sneek"
cask "skype"
cask "zoom"

# Media/Entertainment
cask "pocketcasts"
cask "spotify"
cask "gopro-studio"
cask "clipgrab"
cask "vlc"
cask "vlcstreamer"
cask "plex-media-server"

# Utilities
cask "chrome-remote-desktop-host"
cask "fantastical"
cask "duet"
cask "resolutionator"
cask "drobo-dashboard"
cask "carbon-copy-cloner"
cask "superduper"
cask "handbrake"
cask "transmission"
cask "the-unarchiver"
cask "screenflow"
cask "gpgtools"
cask "istat-menus"
cask "tripmode"
cask "audio-hijack"
cask "loopback"
cask "soundsource"
case "musescore"
cask "freedom"

# Security
cask "1password"
cask "authy"
cask "veracrypt"
cask "tunnelbear"


# Mac App Store Installs
mas "Day One Classic", id: 422304217
mas "Blackmagic Disk Speed Test", id: 425264550
mas "Fantastical", id: 435003921
mas "iHex", id: 909566003
mas "CloudApp", id: 417602904
mas "Forecast Bar", id: 982710545
mas "Noizio", id: 928871589
mas "Better Rename 9", id: 414209656
mas "Magnet", id: 441258766
mas "Video2GIF", id: 672062950
mas "The Unarchiver", id: 425424353
mas "Pocket", id: 568494494
mas "Tweetbot", id: 557168941
mas "WiFi Explorer", id: 494803304
mas "Byword", id: 420212497
mas "Pages", id: 409201541
mas "Tunesify", id: 412675054
mas "PageLayers", id: 437835477
mas "Bear", id: 1091189122
mas "YubiKey Personalization Tool", id: 638161122
mas "Trello", id: 1278508951
mas "Teracopy", id: 1378806557
mas "Dmesh", id: 480992638