#Brewfile

# Taps
tap "buo/cask-upgrade"
tap "caskroom/cask"
tap "caskroom/versions"
tap "ethereum/ethereum"
tap "homebrew/bundle"
tap "homebrew/php"
tap "homebrew/services"

# Unix
brew "ctags"
brew "git"
brew "openssl"
brew "vim"
brew "zsh"

# Heroku
brew "heroku-toolbelt"

# Image/Video manipulation
brew "imagemagick"
brew handbrake
brew ffmpeg
brew mkvtoolnix
brew mp4v2
brew mpv

# Languages and package managers
brew "node"
brew "nvm"
brew "yarn"

# Databases
brew "postgres", restart_service: true
brew "redis", restart_service: true


# Homebrew Cask Installs
# Browsers
cask "google-chrome"
cask "blisk"
cask "firefox"
cask "caskroom/versions/firefox-developer-edition"
cask "torbrowser"

# Productivity
cask "alfred"

# Storage/Documents
cask "dropbox"
cask "google-backup-and-sync"
cask "evernote"

# Design
cask "balsamiq-mockups"
cask "noun-project"
cask "skyfonts"
cask "colorsnapper"
cask "sketch"

# Development
cask "hyper"
cask "iterm2"
cask "macvim"
cask "codekit"
cask "visual-studio-code"
cask "postman"
cask "paw"
cask "docker"
cask "github"
cask "mamp"
cask "kitematic"
cask "transmit"
cask "vmware-fusion"
cask "virtualbox"
cask "sourcetree"
cask "dash"
cask "java"

# Database
cask "postgres"
cask "postico"
cask "navicat-for-sqlite"
cask "navicat-for-postgresql"

# Communication
cask "slack"
cask "adium"
cask "google-hangouts"
cask "skype"
cask "joinme"
cask "ghost"

# Media/Entertainment
cask "pocketcasts"
cask "spotify"
cask "silverlight"
cask "flash-player"
cask "music-manager"
cask "kindle"
cask "gopro-studio"
cask "clipgrab"
cask "vlc"
cask "vlcstreamer"
cask "google-photos-backup"
cask "plex-media-server"

# Utilities
cask "chrome-remote-desktop-host"
cask "hazel"
cask "fantastical"
cask "duet"
cask "resolutionator"
cask "drobo-dashboard"
cask "carbon-copy-cloner"
cask "superduper"
cask "handbrake"
cask "transmission"
cask "google-earth"
cask "the-unarchiver"
cask "screenflow"
cask "gpgtools"
cask "istat-menus"
cask "flux"
cask "tripmode"
cask "audio-hijack"
cask "loopback"
cask "mozaic"

# Security
cask "lastpass"
cask "veracrypt"
cask "tunnelbear"

# Mac App Store Installs
mas "Day One Classic", id: 422304217
mas "Blackmagic Disk Speed Test", id: 425264550
mas "Fantastical", id: 435003921
mas "iHex", id: 909566003
mas "CloudApp", id: 417602904
mas "Forecast Bar", id: 982710545
mas "Noizio", id: 928871589
mas "Better Rename 9", id: 414209656
# mas "Magnet", id: 441258766
mas "Video2GIF", id: 672062950
mas "The Unarchiver", id: 425424353
mas "Pocket", id: 568494494
mas "Tweetbot", id: 557168941
mas "WiFi Explorer", id: 494803304
mas "Byword", id: 420212497
mas "Pages", id: 409201541
mas "Helium", id: 1054607607
mas "Tunesify", id: 412675054
mas "Audiobook Builder", id: 406226796
mas "PageLayers", id: 437835477
mas "Bear", id: 1091189122
mas "FocusList", id: 1086877679
mas "LastPass App", id: 926036361
mas "YubiKey Personalization Tool", id: 638161122
mas "Trello", id: 1278508951